tap "caskroom/cask"
tap "homebrew/bundle"
tap "macvim-dev/macvim"

# dropbox first to get syncing starting...
cask "dropbox"

# Lets get some essentials installed first
cask "spectacle"
cask "1password"
cask "firefox"
cask "google-chrome"
cask "divvy"
brew "git"

# dev tools
cask "atom"
cask "iterm2"
cask "docker"

brew "ack"
brew "ansible"
brew "bash"
brew "bash-completion"
brew "ffmpeg"
brew "findutils"
brew "flac"
brew "highlight"
brew "hub"
brew "iperf"
brew "jq"
brew "lame"
brew "macvim-dev/macvim/macvim"
brew "mas"
brew "md5sha1sum"
brew "rbenv"
brew "ruby-build"
brew "python"
brew "sqlite"
brew "tig"
brew "tree"
brew "wget"
brew "unrar"
brew "yarn", args: ["without-node"]
brew "youtube-dl"

mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835

# the rest of the apps
cask "caffeine"
cask "fantastical"
# cask "flux"
cask "handbrake"
cask "java"
cask "kindlegen"
cask "minecraft"
cask "nvalt"
cask "graphiql"
cask "steam"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "zoomus"
