# =================================================================================
#  High priority things first
# =================================================================================
# cask "maestral" # a better, lighter weight Dropbox client - https://maestral.app
brew "bash-completion"
brew "bash"
brew "git"
brew "mise"

cask "cursor"
cask "firefox"
cask "kitty"
cask "rectangle" # simple, open source Mac OS window management - https://rectangleapp.com
cask "zoom"

# =================================================================================
#  medium priority
# =================================================================================
brew "ag"
brew "fd"
brew "findutils"
brew "gh"
brew "hyperfine"
brew "iperf"
brew "jq"
brew "libyaml" # https://github.com/rbenv/ruby-build/wiki
brew "lsd"
brew "mas"
brew "openssl@3" # https://github.com/rbenv/ruby-build/wiki
brew "readline" # https://github.com/rbenv/ruby-build/wiki
brew "redis"
brew "ruby-build"
brew "scc"
brew "shellcheck"
brew "sqlite"
brew "tree"

cask "bartender"
cask "boltai"
cask "chatgpt"
cask "dash"
cask "fantastical"
cask "orbstack"
cask "istat-menus"
cask "roon"

# =================================================================================
#  low priority
# =================================================================================
brew "awscli"
brew "circleci"
brew "ffmpeg"
brew "flac"
brew "gawk"
brew "git-lfs"
brew "graphviz"
brew "lame"
brew "parallel"
brew "shared-mime-info"
brew "wget"
brew "youtube-dl"

cask "font-fira-code"
cask "netnewswire"
cask "todoist"
cask "vlc"

mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Dayone", id: 1055511498
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
